Tekla.Structures.ModelInternal.CylindricalSurfaceNode
The CylindricalSurfaceNode class represents cylindrical surface geometry tree node.

Tekla.Structures.ModelInternal.CylindricalSurfaceNode.#ctor(Tekla.Structures.ModelInternal.CylindricalSurface)
Instantiates a cylindrical surface geometry tree node.
surface: The contour of the node.

Tekla.Structures.ModelInternal.CylindricalSurfaceNode.Surface
The contour points of cylindrical surface geometry.